class DataList {
  static final List<Map<String, String>> picData = [
    {'imageUrl': 'assets/imgs/pic1.jpg', 'title': 'บริษัทกำลังจะเจ๊งในปี 2025'},
    {'imageUrl': 'assets/imgs/pic1.jpg', 'title': 'บริษัทกำลังจะเจ๊งในปี 2025'},
    {'imageUrl': 'assets/imgs/pic1.jpg', 'title': 'บริษัทกำลังจะเจ๊งในปี 2025'},
    {'imageUrl': 'assets/imgs/pic1.jpg', 'title': 'บริษัทกำลังจะเจ๊งในปี 2025'},
    {'imageUrl': 'assets/imgs/pic1.jpg', 'title': 'บริษัทกำลังจะเจ๊งในปี 2025'},
  ];
  static final List<Map<String, dynamic>> newsData = [
    {
      'newsId': '1',
      'imageUrl': 'assets/imgs/pic2.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic10.jpg',
        'assets/imgs/pic11.png',
      ], //'assets/imgs/pic11.png',
    },
    {
      'newsId': '2',
      'imageUrl': 'assets/imgs/pic3.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic2.jpg',
        'assets/imgs/pic3.jpg',
        // 'assets/imgs/pic4.jpg',
      ],
    },
    {
      'newsId': '3',
      'imageUrl': 'assets/imgs/pic4.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที ',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic3.jpg',
        'assets/imgs/pic10.jpg',
        // 'assets/imgs/pic11.png',
      ],
    },
    {
      'newsId': '4',
      'imageUrl': 'assets/imgs/pic5.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic7.jpg',
        'assets/imgs/pic8.jpg',
        // 'assets/imgs/pic9.jpg',
      ],
    },
    {
      'newsId': '5',
      'imageUrl': 'assets/imgs/pic6.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic4.jpg',
        'assets/imgs/pic3.jpg',
        // 'assets/imgs/pic2.jpg',
      ],
    },
    {
      'newsId': '6',
      'imageUrl': 'assets/imgs/pic7.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic3.jpg',
        'assets/imgs/pic11.png',
        // 'assets/imgs/pic5.jpg',
      ],
    },
    {
      'newsId': '7',
      'imageUrl': 'assets/imgs/pic8.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic8.jpg',
        'assets/imgs/pic10.jpg',
        // 'assets/imgs/pic2.jpg',
      ],
    },
    {
      'newsId': '8',
      'imageUrl': 'assets/imgs/pic9.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic4.jpg',
        'assets/imgs/pic8.jpg',
        // 'assets/imgs/pic7.jpg',
      ],
    },

    {
      'newsId': '9',
      'imageUrl': 'assets/imgs/pic10.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic3.jpg',
        'assets/imgs/pic10.jpg',
        // 'assets/imgs/pic11.png',
      ],
    },
  ];
}
