import 'package:flutter/material.dart';

class PrivacyPolicyForm extends StatelessWidget {
  const PrivacyPolicyForm({super.key});

  @override
  Widget build(BuildContext context) {
    return SliverToBoxAdapter(
      child: Padding(
        padding: const EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            const Text(
              'ABS Solution นโยบายความเป็นส่วนตัว',
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            const SizedBox(height: 20),
            const Text(
              'บรรดาข้อกำหนดการใช้งานทั่วไปของ LY Corporation ในเอกสารฉบับนี้ (ต่อไปนี้เรียกว่า "ข้อกำหนดการใช้งาน") ให้บังคับใช้กับทุกคนทุกคน (ต่อไปนี้เรียกว่า "ท่าน" หรือ "ผู้ใช้") ซึ่งอยู่บนบริการในการบริหารจัดการองค์กร (ระบบพัฒนาขึ้น) (ต่อไปนี้เรียกว่า "บริการ") ซึ่งให้บริการโดย LY Corporation (ต่อไปนี้เรียกว่า "บริษัท")',
              style: TextStyle(fontSize: 12),
            ),
            const SizedBox(height: 20),
            _buildSectionTitle('1. บทนำ'),
            const SizedBox(height: 20),
            const Text(
              'บรรดาค่าและข้อกำหนดดังต่อไปนี้เมื่อใช้ในข้อกำหนดการใช้งานฉบับนี้ให้มี '
              'ความหมายตามที่ระบุไว้ดังนี้',
              style: TextStyle(fontSize: 12),
            ),
            const SizedBox(height: 20),
            _buildListItem(
              '1.1. "เนื้อหา"',
              'หมายถึง ข้อมูล เช่น ข้อความ เสียง เพลง รูปภาพ วิดีโอ ซอฟต์แวร์ โปรแกรม รหัสคอมพิวเตอร์ และข้อมูลอื่นๆ',
            ),
            _buildListItem(
              '1.2. "เนื้อหารายการ"',
              'หมายถึง เนื้อหาที่อาจเข้าถึงได้ผ่านทางบริการ',
            ),
            _buildListItem(
              '1.3. "การส่ง (หรือส่ง)"',
              'หมายถึง การส่ง โพสต์ เปิดเผย ให้ หรือการส่งสัญญาณของเนื้อหาไปยังหรือบนบริการ',
            ),
            _buildListItem(
              '1.4. "เนื้อหาที่ส่ง"',
              'หมายถึง เนื้อหาที่ผู้ใช้ได้ส่งไปยังบริการ',
            ),
            _buildListItem(
              '1.5. "เงื่อนไขการใช้งานเฉพาะบุคคล"',
              'หมายถึง เงื่อนไขการใช้งานซึ่งเป็นแตกต่างจากข้อกำหนดการใช้งานในเอกสารฉบับนี้ที่เกี่ยวข้องกับบริการเฉพาะกับนักพัฒนาเผยแพร่หรือผู้โหลดไฟล์ '
                  'และใช้ในการบริหารจัดการสื่อสิ่งต่างๆ เช่น "เงื่อนไขทั่วไป" "เงื่อนไข" "แบบผู้ผลิต" "นโยบาย" หรือชื่ออื่นๆ ที่ทำนองเดียวกัน',
            ),
            _buildListItem(
              '1.6. "ค่าบริการ"',
              'หมายถึง ค่าใช้จ่ายที่จำเป็นสำหรับการใช้บริการไม่ว่าจะมีข้อเรียกประการใดก็ตามเช่น ค่าบริการ อัตรา ค่าธรรมเนียม ค่าสาธารณูปโภค '
                  'ค่าจัดระเบียบที่อยู่ของตัวแทนบริษัทในประเทศค่าบุคคลภายนอกเป็นผู้ติดตาม กองตามหนึ่งดังกล่าว',
            ),
            _buildListItem(
              '1.7. "บริการเสริมสมาชิกมือถือเอง"',
              'หมายถึง บริการต่างๆ ที่คุณสามารถใช้เนื้อหาผ่านระบบหรือบริการที่บริษัทกำหนดได้ภายในระยะเวลาที่กำหนด โดยการชำระค่าธรรมเนียมคงที่',
            ),
            //-----------------------------------------------
            _buildSectionTitle('1. บทนำ'),
            const SizedBox(height: 20),
            const Text(
              'บรรดาค่าและข้อกำหนดดังต่อไปนี้เมื่อใช้ในข้อกำหนดการใช้งานฉบับนี้ให้มี '
              'ความหมายตามที่ระบุไว้ดังนี้',
              style: TextStyle(fontSize: 12),
            ),
            const SizedBox(height: 20),
            _buildListItem(
              '1.1. "เนื้อหา"',
              'หมายถึง ข้อมูล เช่น ข้อความ เสียง เพลง รูปภาพ วิดีโอ ซอฟต์แวร์ โปรแกรม รหัสคอมพิวเตอร์ และข้อมูลอื่นๆ',
            ),
            _buildListItem(
              '1.2. "เนื้อหารายการ"',
              'หมายถึง เนื้อหาที่อาจเข้าถึงได้ผ่านทางบริการ',
            ),
            _buildListItem(
              '1.3. "การส่ง (หรือส่ง)"',
              'หมายถึง การส่ง โพสต์ เปิดเผย ให้ หรือการส่งสัญญาณของเนื้อหาไปยังหรือบนบริการ',
            ),
            _buildListItem(
              '1.4. "เนื้อหาที่ส่ง"',
              'หมายถึง เนื้อหาที่ผู้ใช้ได้ส่งไปยังบริการ',
            ),
            _buildListItem(
              '1.5. "เงื่อนไขการใช้งานเฉพาะบุคคล"',
              'หมายถึง เงื่อนไขการใช้งานซึ่งเป็นแตกต่างจากข้อกำหนดการใช้งานในเอกสารฉบับนี้ที่เกี่ยวข้องกับบริการเฉพาะกับนักพัฒนาเผยแพร่หรือผู้โหลดไฟล์ '
                  'และใช้ในการบริหารจัดการสื่อสิ่งต่างๆ เช่น "เงื่อนไขทั่วไป" "เงื่อนไข" "แบบผู้ผลิต" "นโยบาย" หรือชื่ออื่นๆ ที่ทำนองเดียวกัน',
            ),
            _buildListItem(
              '1.6. "ค่าบริการ"',
              'หมายถึง ค่าใช้จ่ายที่จำเป็นสำหรับการใช้บริการไม่ว่าจะมีข้อเรียกประการใดก็ตามเช่น ค่าบริการ อัตรา ค่าธรรมเนียม ค่าสาธารณูปโภค '
                  'ค่าจัดระเบียบที่อยู่ของตัวแทนบริษัทในประเทศค่าบุคคลภายนอกเป็นผู้ติดตาม กองตามหนึ่งดังกล่าว',
            ),
            _buildListItem(
              '1.7. "บริการเสริมสมาชิกมือถือเอง"',
              'หมายถึง บริการต่างๆ ที่คุณสามารถใช้เนื้อหาผ่านระบบหรือบริการที่บริษัทกำหนดได้ภายในระยะเวลาที่กำหนด โดยการชำระค่าธรรมเนียมคงที่',
            ),
            //---------------------------------------------
            _buildSectionTitle('2.การใช้บริการ'),
            const SizedBox(height: 20),
            _buildListItem(
              '2.1. ในการใช้บริการ"',
              'คุณจะต้องยอมรับข้อกำหนดการใช้งานในเอกสารฉบับนี้ โดยไม่ว่าจะมีการเรียกเก็บเงินหรือไม่ หรือจำเป็นต้องลงทะเบียนบัญชีหรือไม่ก็ตาม',
            ),
            _buildListItem(
              '2.2. ในการเข้าใช้บริการซึ่งให้บริการโดยไม่คิดค่าบริการ"',
              '(จำกัดเฉพาะบริการที่สามารถเข้าใช้งานได้โดยไม่จำเป็นต้องลงทะเบียนบัญชี) บริษัทจะถือว่าคุณได้ตกลงยอมรับตามข้อกำหนดการใช้งานในเอกสารฉบับนี้แล้ว',
            ),
            _buildListItem(
              '2.3.',
              'ผู้ใช้ที่เป็นผู้เยาว์จะใช้บริการได้ก็ต่อเมื่อได้รับความยินยอมล่วงหน้าจากบิดามารดาหรือผู้ปกครองตามกฎหมายแล้วเท่านั้น',
            ),
            _buildListItem(
              '2.4."',
              'หากผู้ใช้จะเข้าใช้บริการในนามของหรือเพื่อวัตถุประสงค์ขององค์กรธุรกิจ องค์กรธุรกิจดังกล่าวจะต้องตกลงยอมรับข้อกำหนดการใช้งานในเอกสารฉบับนี้ก่อนที่จะใช้บริการด้วย',
            ),
            _buildListItem(
              '2.5."',
              'ผู้ใช้จะต้องใช้บริการด้วยความรับผิดชอบของตนเอง',
            ),
          ],
        ),
      ),
    );
  }

  Widget _buildSectionTitle(String title) {
    return Text(
      title,
      style: const TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
    );
  }

  Widget _buildListItem(String title, String content) {
    return Padding(
      padding: const EdgeInsets.only(bottom: 20.0),
      child: Text(
        '$title $content', // รวม title และ content ไว้ใน Text เดียวกัน
        style: const TextStyle(fontSize: 12),
      ),
    );
  }
}
