import 'package:flutter/material.dart';
import 'package:get/get.dart';

import '../../routes/app_routes.dart';

class DataList {
  static final List<Map<String, String>> picData = [
    {'imageUrl': 'assets/imgs/pic1.jpg', 'title': 'บริษัทกำลังจะเจ๊งในปี 2025'},
    {'imageUrl': 'assets/imgs/pic1.jpg', 'title': 'บริษัทกำลังจะเจ๊งในปี 2025'},
    {'imageUrl': 'assets/imgs/pic1.jpg', 'title': 'บริษัทกำลังจะเจ๊งในปี 2025'},
    {'imageUrl': 'assets/imgs/pic1.jpg', 'title': 'บริษัทกำลังจะเจ๊งในปี 2025'},
    {'imageUrl': 'assets/imgs/pic1.jpg', 'title': 'บริษัทกำลังจะเจ๊งในปี 2025'},
  ].obs;
  static final List<Map<String, dynamic>> newsData = [
    {
      'newsId': '1',
      'imageUrl': 'assets/imgs/pic2.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic10.jpg',
        'assets/imgs/pic11.png',
      ], //'assets/imgs/pic11.png',
    },
    {
      'newsId': '2',
      'imageUrl': 'assets/imgs/pic3.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic2.jpg',
        'assets/imgs/pic3.jpg',
        // 'assets/imgs/pic4.jpg',
      ],
    },
    {
      'newsId': '3',
      'imageUrl': 'assets/imgs/pic4.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที ',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic3.jpg',
        'assets/imgs/pic10.jpg',
        // 'assets/imgs/pic11.png',
      ],
    },
    {
      'newsId': '4',
      'imageUrl': 'assets/imgs/pic5.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic7.jpg',
        'assets/imgs/pic8.jpg',
        // 'assets/imgs/pic9.jpg',
      ],
    },
    {
      'newsId': '5',
      'imageUrl': 'assets/imgs/pic6.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic4.jpg',
        'assets/imgs/pic3.jpg',
        // 'assets/imgs/pic2.jpg',
      ],
    },
    {
      'newsId': '6',
      'imageUrl': 'assets/imgs/pic7.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic3.jpg',
        'assets/imgs/pic11.png',
        // 'assets/imgs/pic5.jpg',
      ],
    },
    {
      'newsId': '7',
      'imageUrl': 'assets/imgs/pic8.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic8.jpg',
        'assets/imgs/pic10.jpg',
        // 'assets/imgs/pic2.jpg',
      ],
    },
    {
      'newsId': '8',
      'imageUrl': 'assets/imgs/pic9.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic4.jpg',
        'assets/imgs/pic8.jpg',
        // 'assets/imgs/pic7.jpg',
      ],
    },

    {
      'newsId': '9',
      'imageUrl': 'assets/imgs/pic10.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic3.jpg',
        'assets/imgs/pic10.jpg',
        // 'assets/imgs/pic11.png',
      ],
    },
  ].obs;

  static final List<Map<String, dynamic>> menuData = [
    {
      'icon': Icons.description_outlined,
      'title': 'ขอใบลา',
      'onPressed': () => Get.toNamed(AppRoutes.LEAVE),
    },
    {
      'icon': Icons.note_add_outlined,
      'title': 'ขอเอกสาร',
      'onPressed': () => Get.toNamed(AppRoutes.DOCUMENTS),
    },
    {
      'icon': Icons.access_time,
      'title': 'ตารางเวลา',
      'onPressed': () => Get.toNamed(AppRoutes.TIMETABLE),
    },
    {
      'icon': Icons.monetization_on_outlined,
      'title': 'เงินเดือน',
      'onPressed': () => Get.toNamed(AppRoutes.SALARY),
    },
    {
      'icon': Icons.account_circle,
      'title': 'ข้อมูลพนักงาน',
      'onPressed': () {},
    },
    {
      'icon': Icons.insert_chart_outlined_outlined,
      'title': 'ร้องเรียน',
      'onPressed': () {},
    },
    {'icon': Icons.dashboard, 'title': 'จัดการเวลา', 'onPressed': () {}},
    {'icon': Icons.more_horiz, 'title': 'อื่นๆ', 'onPressed': () {}},
    {
      'icon': Icons.more_horiz,
      'title': 'กิจกรรม',
      'onPressed': () => Get.toNamed(AppRoutes.ACTIVITYDETAIL),
    },
    {
      'icon': Icons.more_horiz,
      'title': 'รายละเอียดกิจกรรม',
      'onPressed': () => Get.toNamed(AppRoutes.MEETINGDETAIL),
    },
  ].obs;

  static final List<Map<String, dynamic>> quotasData = [
    {'type': 'ลากิจ (ได้รับค่าจ้าง)', 'remaining': 2, 'total': 10},
    {'type': 'ลากิจ (ไม่ได้รับค่าจ้าง)', 'remaining': 5, 'total': 10},
    {'type': 'ลาป่วย', 'remaining': 10, 'total': 10},
    {'type': 'ลาคลอด (ได้รับค่าจ้าง)', 'remaining': 10, 'total': 10},
    {'type': 'ลาคลอด (ไม่ได้รับค่าจ้าง)', 'remaining': 10, 'total': 10},
    {'type': 'ลาพักร้อน', 'remaining': 10, 'total': 10},
    {'type': 'ขาดงาน ', 'remaining': 10, 'total': 10},
  ].obs;

  static final List<Map<String, dynamic>> docTypes = [
    {'type': 'ขอโอทีล่วงหน้า'},
    {'type': 'ขอใบรับรอง'},
    {'type': 'ขอเอกสาร'},
  ].obs;
}
