import 'package:flutter/material.dart';
import 'package:get/get.dart';
import 'package:go_hrm/app/ui/utils/assets.dart';

import '../../routes/app_routes.dart';

class DataList {
  static final List<Map<String, dynamic>> newsData = [
    {
      'newsId': '1',
      'imageUrl': 'assets/imgs/pic2.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic10.jpg',
        'assets/imgs/pic11.png',
      ], //'assets/imgs/pic11.png',
    },
    {
      'newsId': '2',
      'imageUrl': 'assets/imgs/pic3.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic2.jpg',
        'assets/imgs/pic3.jpg',
        // 'assets/imgs/pic4.jpg',
      ],
    },
    {
      'newsId': '3',
      'imageUrl': 'assets/imgs/pic4.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที ',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic3.jpg',
        'assets/imgs/pic10.jpg',
        // 'assets/imgs/pic11.png',
      ],
    },
    {
      'newsId': '4',
      'imageUrl': 'assets/imgs/pic5.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic7.jpg',
        'assets/imgs/pic8.jpg',
        // 'assets/imgs/pic9.jpg',
      ],
    },
    {
      'newsId': '5',
      'imageUrl': 'assets/imgs/pic6.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic4.jpg',
        'assets/imgs/pic3.jpg',
        // 'assets/imgs/pic2.jpg',
      ],
    },
    {
      'newsId': '6',
      'imageUrl': 'assets/imgs/pic7.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic3.jpg',
        'assets/imgs/pic11.png',
        // 'assets/imgs/pic5.jpg',
      ],
    },
    {
      'newsId': '7',
      'imageUrl': 'assets/imgs/pic8.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic8.jpg',
        'assets/imgs/pic10.jpg',
        // 'assets/imgs/pic2.jpg',
      ],
    },
    {
      'newsId': '8',
      'imageUrl': 'assets/imgs/pic9.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic4.jpg',
        'assets/imgs/pic8.jpg',
        // 'assets/imgs/pic7.jpg',
      ],
    },

    {
      'newsId': '9',
      'imageUrl': 'assets/imgs/pic10.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic3.jpg',
        'assets/imgs/pic10.jpg',
        // 'assets/imgs/pic11.png',
      ],
    },
  ].obs;
  static final List<Map<String, dynamic>> userData = [
    {
      'userId': '1',
      // 'imgProfile': '',
      'userName': 'ณัฐดนย์ ธวัชผ่องศรี',
      'employeeId': '20500423546',
      'idCard': '1102200213456',
      'section': 'ยูไอดีไซนเนอร์',
      'nameTitle': 'นาย',
      'nickName': 'ดริว',
      'firstNameTH': 'ณัฐดนย์',
      'lastNameTH': 'ธวัชผ่องศรี',
      'firstNameEN': 'Natthadol',
      'lastNameEN': 'Thavachpongsri',
      'sex': 'ชาย',
      'birthday': '09/09/2025',
      'birthplace': 'กรุงเทพ',
      'age': '21 ปี',
      'email': 'admin@gmail.com',
      'phone': '0888888888',
      'addressTH': '22 ซอย เพชรเกษม 47/2 แขวงบางแค บางแค กรุงเทพมหานคร 10160',
      'addressEN':
          '22 Soi Petchkasem 47/2, Bang Khae Office, Bang Khae, Bangkok 10160',
      'password': '123456',
    },
    {
      'userId': '2',
      'imgProfile': 'assets/imgs/pic2.jpg',
      'userName': 'สมหญิง ยิ่งเจริญ',
      'employeeId': '20500123456',
      'idCard': '1102200987654',
      'section': 'การตลาด',
      'nameTitle': 'นางสาว',
      'nickName': 'หญิง',
      'firstNameTH': 'สมหญิง',
      'lastNameTH': 'ยิ่งเจริญ',
      'firstNameEN': 'Somying',
      'lastNameEN': 'Yingcharoen',
      'sex': 'หญิง',
      'birthday': '10/10/2000',
      'placeOfBirth': 'เชียงใหม่',
      'age': '25 ปี',
      'email': 'user@gmail.com',
      'phone': '0812345678',
      'addressTH': '123 ถนนนิมมานเหมินท์ อำเภอเมือง เชียงใหม่ 50200',
      'addressEN': '123 Nimmanhaemin Rd, Mueang, Chiang Mai 50200',
      'password': '654321',
    },
  ];

  // หมวด: งานเอกสาร
  static final List<Map<String, dynamic>> allMenus = [
    // หมวด: งานเอกสาร
    {
      'iconId': '1',
      'icon': Icons.description_outlined,
      'title': 'ขอใบลา',
      'onPressed': () => Get.toNamed(AppRoutes.LEAVE),
      'category': 'งานเอกสาร', // จัดเข้าหมวดหมู่นี้
    },
    {
      'iconId': '2',
      'icon': Icons.note_add_outlined,
      'title': 'ขอเอกสาร',
      'onPressed': () => Get.toNamed(AppRoutes.DOCUMENTS),
      'category': 'งานเอกสาร',
    },
    {
      'iconId': '3',
      'icon': Icons.edit_document,
      'title': 'เอกสารของฉัน',
      'onPressed': () {},
      'category': 'งานเอกสาร',
    },
    // หมวด: การเงิน
    {
      'iconId': '4',
      'icon': Icons.monetization_on_outlined,
      'title': 'เงินเดือน',
      'onPressed': () => Get.toNamed(AppRoutes.SALARY),
      'category': 'การเงิน', // สร้างหมวดหมู่ใหม่
    },
    // หมวด: พนักงาน
    {
      'iconId': '5',
      'icon': Icons.account_circle,
      'title': 'ข้อมูลพนักงาน',
      'onPressed': () {},
      'category': 'พนักงาน',
    },
    {
      'iconId': '6',
      'icon': Icons.person_search_outlined,
      'title': 'ค้นหาพนักงาน',
      'onPressed': () {},
      'category': 'พนักงาน',
    },
    {
      'iconId': '7',
      'icon': Icons.group_add_outlined,
      'title': 'ทีมของฉัน',
      'onPressed': () {},
      'category': 'พนักงาน',
    },
    // หมวด: ตารางเวลา
    {
      'iconId': '8',
      'icon': Icons.access_time,
      'title': 'ตารางเวลา',
      'onPressed': () => Get.toNamed(AppRoutes.TIMETABLE),
      'category': 'ตารางเวลา',
    },
    {
      'iconId': '9',
      'icon': Icons.dashboard,
      'title': 'จัดการเวลา',
      'onPressed': () {},
      'category': 'ตารางเวลา',
    },
    {
      'iconId': '10',
      'icon': Icons.schedule_outlined,
      'title': 'ปฏิทิน',
      'onPressed': () => Get.toNamed(AppRoutes.CALENDER),
      'category': 'ตารางเวลา',
    },
    // หมวด: กิจกรรม
    {
      'iconId': '11',
      'icon': Icons.more_horiz, // ควรเปลี่ยนไอคอนให้สื่อความหมาย
      'title': 'กิจกรรม',
      'onPressed': () => Get.toNamed(AppRoutes.ACTIVITYDETAIL),
      'category': 'กิจกรรม', // สร้างหมวดหมู่ใหม่
    },
    {
      'iconId': '12',
      'icon': Icons.more_horiz, // ควรเปลี่ยนไอคอนให้สื่อความหมาย
      'title': 'รายละเอียดกิจกรรม',
      'onPressed': () => Get.toNamed(AppRoutes.MEETINGDETAIL),
      'category': 'กิจกรรม',
    },
    // หมวด: อื่นๆ
    {
      'iconId': '13',
      'icon': Icons.insert_chart_outlined_outlined,
      'title': 'ร้องเรียน',
      'onPressed': () {},
      'category': 'อื่นๆ', // สร้างหมวดหมู่ใหม่
    },
    {
      'iconId': '14',
      'icon': Icons.more_horiz,
      'title': 'อื่นๆ',
      'onPressed': () {},
      'category': 'อื่นๆ',
    },
  ];

  // --- defaultFavoriteMenus จะใช้สำหรับกำหนด 'ค่าเริ่มต้น' เท่านั้น ---
  // เราจะดึงข้อมูลจาก allMenus มาใช้
  static final List<Map<String, dynamic>> favoriteMenu = [
    {
      'userId': '1',
      'iconId': ['1', '2', '8', '4', '5', '13', '9', '14'],
    },
    {
      'userId': '2',
      'iconId': ['1', '2', '8', '4'],
    },
  ];

  static final List<Map<String, dynamic>> quotasData = [
    {'typeId': '1', 'type': 'ลากิจ (ได้รับค่าจ้าง)', 'remaining': 2, 'total': 10},
    {
      'typeId': '2',
      'type': 'ลากิจ (ไม่ได้รับค่าจ้าง)',
      'remaining': 5,
      'total': 10,
    },
    {'typeId': '3', 'type': 'ลาป่วย', 'remaining': 10, 'total': 10},
    {
      'typeId': '4',
      'type': 'ลาคลอด (ได้รับค่าจ้าง)',
      'remaining': 10,
      'total': 10,
    },
    {
      'typeId': '5',
      'type': 'ลาคลอด (ไม่ได้รับค่าจ้าง)',
      'remaining': 10,
      'total': 10,
    },
    {'typeId': '6', 'type': 'ลาพักร้อน', 'remaining': 10, 'total': 10},
    {'typeId': '7', 'type': 'ขาดงาน ', 'remaining': 10, 'total': 10},
  ].obs;

  static final List<Map<String, dynamic>> docTypes = [
    {'doctypeId': '1', 'type': 'ขอโอทีล่วงหน้า'},
    {'doctypeId': '2', 'type': 'ขอใบรับรอง'},
    {'doctypeId': '3', 'type': 'ขอเอกสาร'},
  ].obs;

  // เพิ่มข้อมูลเงินเดือนพร้อมเดือนและวันที่จ่าย
  static final List<Map<String, dynamic>> salaryData = [
    {'month': 'มกราคม', 'datePaid': '25/01/2025 เวลา 12.00 น.'},
    {'month': 'กุมภาพันธ์', 'datePaid': '25/02/2025 เวลา 12.00 น.'},
    {'month': 'มีนาคม', 'datePaid': '25/03/2025 เวลา 12.00 น.'},
    {'month': 'เมษายน', 'datePaid': '25/04/2025 เวลา 12.00 น.'},
    {'month': 'พฤษภาคม', 'datePaid': '25/05/2025 เวลา 12.08 น.'},
    {'month': 'มิถุนายน', 'datePaid': '25/06/2025 เวลา 12.00 น.'},
    {'month': 'กรกฎาคม', 'datePaid': '25/07/2025 เวลา 12.00 น.'},
    {'month': 'สิงหาคม', 'datePaid': '25/08/2025 เวลา 12.00 น.'},
    {'month': 'กันยายน', 'datePaid': '25/09/2025 เวลา 12.00 น.'},
    {'month': 'ตุลาคม', 'datePaid': '25/10/2025 เวลา 12.00 น.'},
    {'month': 'พฤศจิกายน', 'datePaid': '25/11/2025 เวลา 12.00 น.'},
    {'month': 'ธันวาคม', 'datePaid': '25/12/2025 เวลา 12.00 น.'},
  ].obs;
}
