import 'dart:io';

import 'package:flutter/material.dart';
import 'package:get/get.dart';
import 'package:go_hrm/app/data/models/leave_status_model.dart';

import '../../data/models/appeal_status_model.dart';
import '../../data/models/document_status_model.dart';
import '../../routes/app_routes.dart';

class DataList {
  static final List<Map<String, dynamic>> newsData = [
    {
      'newsId': '1',
      'imageUrl': 'assets/imgs/pic2.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic10.jpg',
        'assets/imgs/pic11.png',
      ], //'assets/imgs/pic11.png',
    },
    {
      'newsId': '2',
      'imageUrl': 'assets/imgs/pic3.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic2.jpg',
        'assets/imgs/pic3.jpg',
        // 'assets/imgs/pic4.jpg',
      ],
    },
    {
      'newsId': '3',
      'imageUrl': 'assets/imgs/pic4.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที ',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic3.jpg',
        'assets/imgs/pic10.jpg',
        // 'assets/imgs/pic11.png',
      ],
    },
    {
      'newsId': '4',
      'imageUrl': 'assets/imgs/pic5.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic7.jpg',
        'assets/imgs/pic8.jpg',
        // 'assets/imgs/pic9.jpg',
      ],
    },
    {
      'newsId': '5',
      'imageUrl': 'assets/imgs/pic6.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic4.jpg',
        'assets/imgs/pic3.jpg',
        // 'assets/imgs/pic2.jpg',
      ],
    },
    {
      'newsId': '6',
      'imageUrl': 'assets/imgs/pic7.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic3.jpg',
        'assets/imgs/pic11.png',
        // 'assets/imgs/pic5.jpg',
      ],
    },
    {
      'newsId': '7',
      'imageUrl': 'assets/imgs/pic8.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic8.jpg',
        'assets/imgs/pic10.jpg',
        // 'assets/imgs/pic2.jpg',
      ],
    },
    {
      'newsId': '8',
      'imageUrl': 'assets/imgs/pic9.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic4.jpg',
        'assets/imgs/pic8.jpg',
        // 'assets/imgs/pic7.jpg',
      ],
    },

    {
      'newsId': '9',
      'imageUrl': 'assets/imgs/pic10.jpg',
      'title': 'บริษัทกำลังจะเจ๊งในปี 2025',
      'date': '10/08/2025',
      'description':
          'มีนโยบายไล่พนักงานทั้งหมดออก และปิดสายการผลิตทั้งหมดทุกจุด โดยมีผลบังคับใช้ทันทีและถาวร โดยมีผลบังคับใช้ทันทีและถาวรที',
      'deiailstitle': 'เรื่อง การเลิกจ้างและดำเนินการผลิตโดยทันทีและถาวร',
      'deiails': [
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
        'จากการพิจารณากลยุทธ์ภายในอย่างละเอียดถี่ถ้วน'
            'ทีมผู้บริหารระดับสูงได้ตัดสินใจที่จะดำเนินการปรับโครงสร้าง'
            'การดำเนินงานอย่างครอบคลุมซึ่งจะเปลี่ยนแปลงทิศทางและการจัดสรรทรัพยากรของบริษัทไปอย่างสิ้นเชิงหลังจากประเมินการคาดการณ์ตลาดในระยะยาว ความยั่งยืนทางการเงิน'
            'ความท้าทายทางเศรษฐกิจระดับโลกและการเปลี่ยนแปลงทางเทคโนโลยีแล้วเราได้ข้อสรุปว่ากิจกรรมการผลิตในปัจจุบัน'
            'ที่ดำเนินต่อไปนั้นไม่สามารถทำได้อีกต่อไปและไม่สอดคล้องกับวิสัยทัศน์ในอนาคตของเรามีผลทันทีสายการผลิต'
            'และการผลิตทั้งหมดในทุกไซต์จะหยุดดำเนินการอย่างถาวรดังนั้นพนักงานทุกคนในทุกแผนกและสิ่งอำนวยความสะดวกจะถูกเลิกจ้างอย่างเป็นทางการตั้งแต่วันนี้เป็นต้นไป'
            'การตัดสินใจนี้ถือเป็นที่สิ้นสุดไม่สามารถย้อนกลับได้และใช้กับสาขาในประเทศและต่างประเทศทั้งหมด'
            'โดยไม่มีข้อยกเว้นเราขอแสดงความนับถือและชื่นชมการทำงานหนักความทุ่มเทและความภักดี'
            'ที่แสดงให้เห็นโดยสมาชิกในทีมทุกคนตลอดหลายปีที่ผ่านมาการสนับสนุนของคุณมีบทบาทสำคัญในพนักงานทุกคนต้องหลีกเลี่ยงการเข้าถึงพื้นที่การผลิต '
            'และให้ความร่วมมืออย่างเต็มที่กับขั้นตอนการออกจากงาน',
      ],
      'imagedetails': [
        'assets/imgs/pic3.jpg',
        'assets/imgs/pic10.jpg',
        // 'assets/imgs/pic11.png',
      ],
    },
  ].obs;
  static final List<Map<String, dynamic>> userData = [
    {
      'userId': '1',
      // 'imgProfile': '',
      'userName': 'ณัฐดนย์ ธวัชผ่องศรี', 'employeeId': '20500423546',
      'idCard': '1102200213456',
      'section': 'ยูไอดีไซนเนอร์',
      'nameTitle': 'นาย',
      'nickName': 'ดริว',
      'firstNameTH': 'ณัฐดนย์',
      'lastNameTH': 'ธวัชผ่องศรี',
      'firstNameEN': 'Natthadol',
      'lastNameEN': 'Thavachpongsri',
      'sex': 'ชาย',
      'birthday': '09/09/2025',
      'birthplace': 'กรุงเทพ',
      'age': '21 ปี', 'email': 'admin@gmail.com',
      'phone': '0888888888',
      'addressTH': '22 ซอย เพชรเกษม 47/2 แขวงบางแค บางแค กรุงเทพมหานคร 10160',
      'addressEN':
          '22 Soi Petchkasem 47/2, Bang Khae Office, Bang Khae, Bangkok 10160',
      'password': '123456',
    },
    {
      'userId': '2',
      'imgProfile': 'assets/imgs/pic2.jpg',
      'userName': 'สมหญิง ยิ่งเจริญ',
      'employeeId': '20500123456',
      'idCard': '1102200987654',
      'section': 'การตลาด',
      'nameTitle': 'นางสาว',
      'nickName': 'หญิง',
      'firstNameTH': 'สมหญิง',
      'lastNameTH': 'ยิ่งเจริญ',
      'firstNameEN': 'Somying',
      'lastNameEN': 'Yingcharoen',
      'sex': 'หญิง',
      'birthday': '10/10/2000',
      'placeOfBirth': 'เชียงใหม่',
      'age': '25 ปี',
      'email': 'user@gmail.com',
      'phone': '0812345678',
      'addressTH': '123 ถนนนิมมานเหมินท์ อำเภอเมือง เชียงใหม่ 50200',
      'addressEN': '123 Nimmanhaemin Rd, Mueang, Chiang Mai 50200',
      'password': '654321',
    },
  ];

  // หมวด: งานเอกสาร
  static final List<Map<String, dynamic>> allMenus = [
    // หมวด: งานเอกสาร
    {
      'iconId': '1',
      'icon': Icons.description_outlined,
      'title': 'ขอใบลา',
      'onPressed': () => Get.toNamed(AppRoutes.LEAVE),
      'category': 'งานเอกสาร', // จัดเข้าหมวดหมู่นี้
    },
    {
      'iconId': '2',
      'icon': Icons.note_add_outlined,
      'title': 'ขอเอกสาร',
      'onPressed': () => Get.toNamed(AppRoutes.DOCUMENTS),
      'category': 'งานเอกสาร',
    },
    {
      'iconId': '3',
      'icon': Icons.edit_document,
      'title': 'เอกสารของฉัน',
      'onPressed': () {},
      'category': 'งานเอกสาร',
    },
    // หมวด: การเงิน
    {
      'iconId': '4',
      'icon': Icons.monetization_on_outlined,
      'title': 'เงินเดือน',
      'onPressed': () => Get.toNamed(AppRoutes.SALARY),
      'category': 'การเงิน', // สร้างหมวดหมู่ใหม่
    },
    // หมวด: พนักงาน
    {
      'iconId': '5',
      'icon': Icons.account_circle,
      'title': 'ข้อมูลพนักงาน',
      'onPressed': () {},
      'category': 'พนักงาน',
    },
    {
      'iconId': '6',
      'icon': Icons.person_search_outlined,
      'title': 'ค้นหาพนักงาน',
      'onPressed': () {},
      'category': 'พนักงาน',
    },
    {
      'iconId': '7',
      'icon': Icons.group_add_outlined,
      'title': 'ทีมของฉัน',
      'onPressed': () {},
      'category': 'พนักงาน',
    },
    // หมวด: ตารางเวลา
    {
      'iconId': '8',
      'icon': Icons.access_time,
      'title': 'ตารางเวลา',
      'onPressed': () => Get.toNamed(AppRoutes.TIMETABLE),
      'category': 'ตารางเวลา',
    },
    {
      'iconId': '9',
      'icon': Icons.dashboard,
      'title': 'จัดการเวลา',
      'onPressed': () {},
      'category': 'ตารางเวลา',
    },
    {
      'iconId': '10',
      'icon': Icons.schedule_outlined,
      'title': 'ปฏิทิน',
      'onPressed': () => Get.toNamed(AppRoutes.CALENDER),
      'category': 'ตารางเวลา',
    },
    // หมวด: กิจกรรม
    {
      'iconId': '11',
      'icon': Icons.more_horiz, // ควรเปลี่ยนไอคอนให้สื่อความหมาย
      'title': 'กิจกรรม',
      'onPressed': () => Get.toNamed(AppRoutes.ACTIVITYDETAIL),
      'category': 'กิจกรรม', // สร้างหมวดหมู่ใหม่
    },
    {
      'iconId': '12',
      'icon': Icons.more_horiz, // ควรเปลี่ยนไอคอนให้สื่อความหมาย
      'title': 'รายละเอียดกิจกรรม',
      'onPressed': () => Get.toNamed(AppRoutes.MEETINGDETAIL),
      'category': 'กิจกรรม',
    },
    // หมวด: อื่นๆ
    {
      'iconId': '13',
      'icon': Icons.insert_chart_outlined_outlined,
      'title': 'ร้องเรียน',
      'onPressed': () => Get.toNamed(AppRoutes.APPEAL),
      'category': 'อื่นๆ', // สร้างหมวดหมู่ใหม่
    },
    {
      'iconId': '14',
      'icon': Icons.more_horiz,
      'title': 'อื่นๆ',
      'onPressed': () {},
      'category': 'อื่นๆ',
    },
  ];

  // --- defaultFavoriteMenus จะใช้สำหรับกำหนด 'ค่าเริ่มต้น' เท่านั้น ---
  // เราจะดึงข้อมูลจาก allMenus มาใช้
  static final List<Map<String, dynamic>> userPreferData = [
    {
      'userId': '1',
      'iconId': ['1', '2', '8', '4', '5', '13', '9', '14'],
      'documentId': ['1', '2', '3'],
      'leaveId': ['1', '2', '3'],
      'salaryId': [
        '1',
        '2',
        '3',
        '4',
        '5',
        '6',
        '7',
        '8',
        '9',
        '10',
        '11',
        '12',
        '13',
        '14',
      ],
      'appealId': ['1', '2', '3', '4', '5', '6'],
    },
    {
      'userId': '2',
      'iconId': ['1', '2', '8', '4'],
      'documentId': ['4', '5', '6', '10'],
      'leaveId': ['4', '5', '6'],
      'salaryId': ['1', '2', '3'],
      'appealId': ['7', '8', '9'],
    },
  ];

  static final List<Map<String, dynamic>> quotasData = [
    {
      'typeId': '1',
      'type': 'ลากิจ (ได้รับค่าจ้าง)',
      'remaining': 2,
      'total': 10,
    },
    {
      'typeId': '2',
      'type': 'ลากิจ (ไม่ได้รับค่าจ้าง)',
      'remaining': 5,
      'total': 10,
    },
    {'typeId': '3', 'type': 'ลาป่วย', 'remaining': 10, 'total': 10},
    {
      'typeId': '4',
      'type': 'ลาคลอด (ได้รับค่าจ้าง)',
      'remaining': 10,
      'total': 10,
    },
    {
      'typeId': '5',
      'type': 'ลาคลอด (ไม่ได้รับค่าจ้าง)',
      'remaining': 10,
      'total': 10,
    },
    {'typeId': '6', 'type': 'ลาพักร้อน', 'remaining': 10, 'total': 10},
    {'typeId': '7', 'type': 'ขาดงาน ', 'remaining': 10, 'total': 10},
  ].obs;

  static final List<Map<String, dynamic>> months = [
    {'monthId': '1', 'month': 'มกราคม'},
    {'monthId': '2', 'month': 'กุมภาพันธ์'},
    {'monthId': '3', 'month': 'มีนาคม'},
    {'monthId': '4', 'month': 'เมษายน'},
    {'monthId': '5', 'month': 'พฤษภาคม'},
    {'monthId': '6', 'month': 'มิถุนายน'},
    {'monthId': '7', 'month': 'กรกฎาคม'},
    {'monthId': '8', 'month': 'สิงหาคม'},
    {'monthId': '9', 'month': 'กันยายน'},
    {'monthId': '10', 'month': 'ตุลาคม'},
    {'monthId': '11', 'month': 'พฤศจิกายน'},
    {'monthId': '12', 'month': 'ธันวาคม'},
  ];

  static final List<Map<String, dynamic>> years = [
    {'yearId': '1', 'year': '2020'},
    {'yearId': '2', 'year': '2021'},
    {'yearId': '3', 'year': '2022'},
    {'yearId': '4', 'year': '2023'},
    {'yearId': '5', 'year': '2024'},
    {'yearId': '6', 'year': '2025'},
  ];

  static final List<Map<String, dynamic>> leaveTypes = [
    {'leaveTypeId': '1', 'type': 'ลากิจ'},
    {'leaveTypeId': '2', 'type': 'ลาป่วย'},
    {'leaveTypeId': '3', 'type': 'ลาพักร้อน'},
  ].obs;

  static final List<Map<String, dynamic>> docTypes = [
    {'documentTypeId': '1', 'type': 'ภาษี'},
    {'documentTypeId': '2', 'type': 'ประกันสังคม'},
    {'documentTypeId': '3', 'type': 'อื่นๆ'},
  ].obs;

  static final List<Map<String, dynamic>> appealTypes = [
    {'appealTypeId': '1', 'type': 'รบกวนการทํางาน'},
    {'appealTypeId': '2', 'type': 'การทำร้ายร่างกาย'},
    {'appealTypeId': '3', 'type': 'การขโมย'},
    {'appealTypeId': '4', 'type': 'ความประพฤติไม่เหมาะสม'},
  ].obs;

  // เพิ่มข้อมูลเงินเดือนพร้อมเดือนและวันที่จ่าย
  static final List<Map<String, dynamic>> salaryData = [
    {
      'salaryId': '1',
      'month': 'มกราคม',
      'datePaid': '25/01/2025 เวลา 12.00 น.',
    },
    {
      'salaryId': '2',
      'month': 'กุมภาพันธ์',
      'datePaid': '25/02/2025 เวลา 12.00 น.',
    },
    {
      'salaryId': '3',
      'month': 'มีนาคม',
      'datePaid': '25/03/2025 เวลา 12.00 น.',
    },
    {
      'salaryId': '4',
      'month': 'เมษายน',
      'datePaid': '25/04/2025 เวลา 12.00 น.',
    },
    {
      'salaryId': '5',
      'month': 'พฤษภาคม',
      'datePaid': '25/05/2025 เวลา 12.08 น.',
    },
    {
      'salaryId': '6',
      'month': 'มิถุนายน',
      'datePaid': '25/06/2025 เวลา 12.00 น.',
    },
    {
      'salaryId': '7',
      'month': 'กรกฎาคม',
      'datePaid': '25/07/2025 เวลา 12.00 น.',
    },
    {
      'salaryId': '8',
      'month': 'สิงหาคม',
      'datePaid': '25/08/2022 เวลา 12.00 น.',
    },
    {
      'salaryId': '9',
      'month': 'กันยายน',
      'datePaid': '25/09/2023 เวลา 12.00 น.',
    },
    {
      'salaryId': '10',
      'month': 'ตุลาคม',
      'datePaid': '25/10/2025 เวลา 12.00 น.',
    },
    {
      'salaryId': '11',
      'month': 'พฤศจิกายน',
      'datePaid': '25/11/2025 เวลา 12.00 น.',
    },
    {
      'salaryId': '12',
      'month': 'ธันวาคม',
      'datePaid': '25/12/2025 เวลา 12.00 น.',
    },
    {
      'salaryId': '13',
      'month': 'ธันวาคม',
      'datePaid': '25/12/2024 เวลา 12.00 น.',
    },
    {
      'salaryId': '14',
      'month': 'พฤศจิกายน',
      'datePaid': '25/11/2024 เวลา 12.00 น.',
    },
  ].obs;

  static final List<Map<String, dynamic>> leaveData = [
    {
      'leaveId': '1',
      'leaveTypeId': '1',
      'employeeName': 'ณัฐดนย์ วัฒนวงศ์ศรีสุข',
      'requestDateTime': DateTime(2025, 6, 25, 12, 6),
      'status': LeaveStatus.approved,
      'attachedFiles': [],
    },
    {
      'leaveId': '2',
      'leaveTypeId': '2',
      'employeeName': 'ณัฐดนย์ วัฒนวงศ์ศรีสุข',
      'requestDateTime': DateTime(2025, 6, 24, 10, 30),
      'status': LeaveStatus.rejected,
      'attachedFiles': [],
    },
    {
      'leaveId': '3',
      'leaveTypeId': '1',
      'employeeName': 'ณัฐดนย์ วัฒนวงศ์ศรีสุข',
      'requestDateTime': DateTime(2025, 6, 25, 12, 6),
      'status': LeaveStatus.approved,
      'attachedFiles': [
        File('/mock/path/ใบรับรองแพทย์.jpg'),
        File('/mock/path/ใบรับรองแพทย์.jpg'),
      ],
    },
    {
      'leaveId': '4',
      'leaveTypeId': '2',
      'employeeName': 'ณัฐดนย์ วัฒนวงศ์ศรีสุข',
      'requestDateTime': DateTime(2025, 6, 24, 10, 30),
      'status': LeaveStatus.rejected,
      'attachedFiles': [File('/mock/path/ใบรับรองแพทย์.jpg')],
    },
    {
      'leaveId': '5',
      'leaveTypeId': '2',
      'employeeName': 'ณัฐดนย์ วัฒนวงศ์ศรีสุข',
      'requestDateTime': DateTime(2025, 6, 25, 12, 6),
      'status': LeaveStatus.approved,
      'attachedFiles': [File('/mock/path/ใบรับรองแพทย์.jpg')],
    },
    {
      'leaveId': '6',
      'leaveTypeId': '3',
      'employeeName': 'ณัฐดนย์ วัฒนวงศ์ศรีสุข',
      'requestDateTime': DateTime(2025, 6, 24, 10, 30),
      'status': LeaveStatus.rejected,
      'attachedFiles': [File('/mock/path/ใบรับรองแพทย์.jpg')],
    },
    {
      'leaveId': '7',
      'leaveTypeId': '1',
      'employeeName': 'สมชาย ใจดี',
      'requestDateTime': DateTime(2025, 7, 1, 9, 0),
      'status': LeaveStatus.pending,
      'attachedFiles': [
        File('/mock/path/ใบรับรองแพทย์.jpg'),
        File('/mock/path/ใบรับรองแพทย์.jpg'),
        File('/mock/path/ใบรับรองแพทย์.jpg'),
      ],
    },
    {
      'leaveId': '8',
      'leaveTypeId': '2',
      'employeeName': 'สมหญิง มุ่งมั่น',
      'requestDateTime': DateTime(2025, 6, 30, 14, 20),
      'status': LeaveStatus.pending,
      'attachedFiles': [File('/mock/path/ใบรับรองแพทย์.jpg')],
    },
    {
      'leaveId': '9',
      'leaveTypeId': '3',
      'employeeName': 'มานะ อดทน',
      'requestDateTime': DateTime(2025, 6, 28, 16, 5),
      'status': LeaveStatus.pending,
      'attachedFiles': [File('/mock/path/ใบรับรองแพทย์.jpg')],
    },
    {
      'leaveId': '10',
      'leaveTypeId': '1',
      'employeeName': 'สมชาย ใจดี',
      'requestDateTime': DateTime(2025, 7, 1, 9, 0),
      'status': LeaveStatus.pending,
      'attachedFiles': [],
    },
    {
      'leaveId': '11',
      'leaveTypeId': '2',
      'employeeName': 'สมหญิง มุ่งมั่น',
      'requestDateTime': DateTime(2025, 6, 30, 14, 20),
      'status': LeaveStatus.pending,
      'attachedFiles': [],
    },
    {
      'leaveId': '12',
      'leaveTypeId': '3',
      'employeeName': 'มานะ อดทน',
      'requestDateTime': DateTime(2025, 6, 28, 16, 5),
      'status': LeaveStatus.pending,
      'attachedFiles': [],
    },
  ].obs;

  static final List<Map<String, dynamic>> appealData = [
    {
      'appealId': '1',
      'employeeName': 'ณัฐดนย์ วัฒนวงศ์ศรีสุข',
      'appealTypeId': '1',
      'requestDateTime': DateTime(2025, 6, 25, 12, 6),
      'note': 'ต้องการเงินล่วงหน้า',
      'status': AppealStatus.approved,
      'attachedFiles': [],
    },
    {
      'appealId': '2',
      'employeeName': 'ณัฐดนย์ วัฒนวงศ์ศรีสุข',
      'appealTypeId': '2',
      'requestDateTime': DateTime(2025, 6, 24, 10, 30),
      'note': 'เอกสารไม่ครบถ้วน',
      'status': AppealStatus.rejected,
      'attachedFiles': [],
    },
    {
      'appealId': '3',
      'employeeName': 'ณัฐดนย์ วัฒนวงศ์ศรีสุข',
      'appealTypeId': '3',
      'requestDateTime': DateTime(2025, 5, 20, 15, 0),
      'note': 'สำหรับยื่นกู้',
      'status': AppealStatus.approved,
      'attachedFiles': [File('/mock/path/appeal.pdf')],
    },
    {
      'appealId': '4',
      'employeeName': 'สมชาย ใจดี',
      'appealTypeId': '4',
      'requestDateTime': DateTime(2025, 7, 1, 9, 0),
      'note': 'ต้องการเงินล่วงหน้า',
      'status': AppealStatus.pending,
      'attachedFiles': [
        File('/mock/path/appeal.pdf'),
        File('/mock/path/ใบรับรองแพทย์.jpg'),
      ],
    },
    {
      'appealId': '5',
      'employeeName': 'สมหญิง มุ่งมั่น',
      'appealTypeId': '4',
      'requestDateTime': DateTime(2025, 6, 30, 14, 20),
      'note': 'อาหารเป็นพิษ',
      'status': AppealStatus.pending,
      'attachedFiles': [File('/mock/path/ใบรับรองแพทย์.jpg')],
    },
    {
      'appealId': '6',
      'employeeName': 'มานะ อดทน',
      'appealTypeId': '4',
      'requestDateTime': DateTime(2025, 6, 28, 16, 5),
      'note': '',
      'status': AppealStatus.pending,
      'attachedFiles': [],
    },
    {
      'appealId': '7',
      'employeeName': 'จิตดี ศรีสวัสดิ์',
      'appealTypeId': '4',
      'requestDateTime': DateTime(2025, 7, 2, 11, 15),
      'note': 'ใช้สำหรับทำธุรกรรม',
      'status': AppealStatus.pending,
      'attachedFiles': [],
    },
    {
      'appealId': '8',
      'employeeName': 'วิชัย มีชัย',
      'appealTypeId': '4',
      'requestDateTime': DateTime(2025, 7, 3, 8, 30),
      'note': 'มีไข้สูง',
      'status': AppealStatus.pending,
      'attachedFiles': [File('/mock/path/ใบรับรองแพทย์_วิชัย.pdf')],
    },
    {
      'appealId': '9',
      'employeeName': 'สมศรี มีสุข',
      'appealTypeId': '4',
      'requestDateTime': DateTime(2025, 7, 4, 17, 0),
      'note': 'ทำงานโปรเจกต์ด่วน',
      'status': AppealStatus.pending,
      'attachedFiles': [],
    },
    {
      'appealId': '10',
      'employeeName': 'ณัฐดนย์ วัฒนวงศ์ศรีสุข', // เอกสารนี้เป็นของ User 1
      'appealTypeId': '4',
      'requestDateTime': DateTime(2025, 7, 5, 10, 0),
      'note': 'ไปเที่ยวต่างจังหวัด',
      'status': AppealStatus.pending,
      'attachedFiles': [],
    },
    {
      'appealId': '11',
      'employeeName': 'มานี รักไทย',
      'appealTypeId': '4',
      'requestDateTime': DateTime(2025, 7, 7, 14, 45),
      'note': 'ใช้สำหรับยื่นวีซ่า',
      'status': AppealStatus.pending,
      'attachedFiles': [
        File('/mock/path/สำเนาบัตรประชาชน.jpg'),
        File('/mock/path/สำเนาทะเบียนบ้าน.jpg'),
      ],
    },
  ];

  static final List<Map<String, dynamic>> documentData = [
    {
      'documentId': '1',
      'documentTypeId': '3',
      'employeeName': 'ณัฐดนย์ วัฒนวงศ์ศรีสุข',
      'requestDateTime': DateTime(2025, 6, 25, 12, 6),
      'note': 'ต้องการเงินล่วงหน้า',
      'status': DocumentStatus.approved,
      'attachedFiles': [],
    },
    {
      'documentId': '2',
      'documentTypeId': '3',
      'employeeName': 'ณัฐดนย์ วัฒนวงศ์ศรีสุข',
      'requestDateTime': DateTime(2025, 6, 24, 10, 30),
      'note': 'เอกสารไม่ครบถ้วน',
      'status': DocumentStatus.rejected,
      'attachedFiles': [],
    },
    {
      'documentId': '3',
      'documentTypeId': '3',
      'employeeName': 'ณัฐดนย์ วัฒนวงศ์ศรีสุข',
      'requestDateTime': DateTime(2025, 5, 20, 15, 0),
      'note': 'สำหรับยื่นกู้',
      'status': DocumentStatus.approved,
      'attachedFiles': [File('/mock/path/doc.pdf')],
    },
    {
      'documentId': '4',
      'documentTypeId': '3',
      'employeeName': 'สมชาย ใจดี',
      'requestDateTime': DateTime(2025, 7, 1, 9, 0),
      'note': 'ต้องการเงินล่วงหน้า',
      'status': DocumentStatus.pending,
      'attachedFiles': [File('/mock/path/doc.pdf')],
    },
    {
      'documentId': '5',
      'documentTypeId': '2',
      'employeeName': 'สมหญิง มุ่งมั่น',
      'requestDateTime': DateTime(2025, 6, 30, 14, 20),
      'note': 'อาหารเป็นพิษ',
      'status': DocumentStatus.pending,
      'attachedFiles': [File('/mock/path/ใบรับรองแพทย์.jpg')],
    },
    {
      'documentId': '6',
      'documentTypeId': '3',
      'employeeName': 'มานะ อดทน',
      'requestDateTime': DateTime(2025, 6, 28, 16, 5),
      'note': '',
      'status': DocumentStatus.pending,
      'attachedFiles': [],
    },
    {
      'documentId': '7',
      'documentTypeId': '3',
      'employeeName': 'จิตดี ศรีสวัสดิ์',
      'requestDateTime': DateTime(2025, 7, 2, 11, 15),
      'note': 'ใช้สำหรับทำธุรกรรม',
      'status': DocumentStatus.pending,
      'attachedFiles': [],
    },
    {
      'documentId': '8',
      'documentTypeId': '2',
      'employeeName': 'วิชัย มีชัย',
      'requestDateTime': DateTime(2025, 7, 3, 8, 30),
      'note': 'มีไข้สูง',
      'status': DocumentStatus.pending,
      'attachedFiles': [File('/mock/path/ใบรับรองแพทย์_วิชัย.pdf')],
    },
    {
      'documentId': '9',
      'documentTypeId': '3',
      'employeeName': 'สมศรี มีสุข',
      'requestDateTime': DateTime(2025, 7, 4, 17, 0),
      'note': 'ทำงานโปรเจกต์ด่วน',
      'status': DocumentStatus.pending,
      'attachedFiles': [],
    },
    {
      'documentId': '10',
      'documentTypeId': '3',
      'employeeName': 'ณัฐดนย์ วัฒนวงศ์ศรีสุข', // เอกสารนี้เป็นของ User 1
      'requestDateTime': DateTime(2025, 7, 5, 10, 0),
      'note': 'ไปเที่ยวต่างจังหวัด',
      'status': DocumentStatus.pending,
      'attachedFiles': [],
    },
    {
      'documentId': '11',
      'documentTypeId': '1',
      'employeeName': 'มานี รักไทย',
      'requestDateTime': DateTime(2025, 7, 7, 14, 45),
      'note': 'ใช้สำหรับยื่นวีซ่า',
      'status': DocumentStatus.pending,
      'attachedFiles': [
        File('/mock/path/สำเนาบัตรประชาชน.jpg'),
        File('/mock/path/สำเนาทะเบียนบ้าน.jpg'),
      ],
    },
  ];

  static final Map<DateTime, List<Map<String, dynamic>>> calenderEventsData = {
    // วันที่ 1 มกราคม 2025
    DateTime.utc(2025, 1, 1): [
      {
        'title': 'วันขึ้นปีใหม่',
        'description': 'วันหยุดนักขัตฤกษ์',
        'time': 'ทั้งวัน',
        'note': 'วันหยุดนักขัตฤกษ์',
      },
    ],
    // วันที่ 10 มกราคม 2025 (ตามรูปภาพ)
    DateTime.utc(2025, 1, 10): [
      {
        'title': 'ประชุมกับผู้บริหาร',
        'description': 'ประชุมกับผู้บริหารระดับสูงเพื่อรายงานความคืบหน้าของงาน',
        'time': '10.30 - 11.30',
        'note': 'ประชุมกับผู้บริหารระดับสูง',
      },
      {
        'title': 'วันก่อตั้งบริษัท',
        'description':
            'เป็นวันที่ก่อตั้งบริษัทเป็นมาวันแรก ให้เป็นวันหยุดงานทุกคน',
        'time': 'ทั้งวัน',
        'note': 'เป็นวันที่ก่อตั้งบริษัท',
      },
      {
        'title': 'วันตรวจสุขภาพของบริษัท',
        'description':
            'ตรวจสุขภาพประจำปีของพนักงาน มาตรา 3 โดยหมอผู้เชี่ยวชาญด้านต่างๆ',
        'time': 'ทั้งวัน',
        'note': 'วันตรวจสุขภาพของบริษัท',
      },
      {
        'title': 'วันเกิดเจ้านาย',
        'description': 'วันนี้ต้องซื้อของขวัญ HBD เจ้านาย',
        'time': 'ทั้งวัน',
        'note': 'วันเกิดเจ้านาย',
      },
    ],
    // วันที่ 30 มกราคม 2025
    DateTime.utc(2025, 1, 30): [
      {
        'title': 'จ่ายเงินเดือน',
        'description': 'รอบจ่ายเงินเดือนมกราคม',
        'time': 'ทั้งวัน',
        'note': 'จ่ายเงินเดือนมกราคม',
      },
    ],
    DateTime.utc(2025, 7, 4): [
      {
        'title': 'วันหยุดครึ่งปีธนาคาร',
        'description': 'ธนาคารหยุดทำการ',
        'time': 'ทั้งวัน',
        'note': 'วันหยุดครึ่งปีธนาคาร',
      },
    ],

    // --- วันที่ 17 กรกฎาคม 2025 (วันนี้) ---
    DateTime.utc(2025, 7, 17): [
      {
        'title': 'ประชุมทีม Marketing',
        'description': 'ประชุมวางแผนแคมเปญไตรมาสที่ 3',
        'time': '14:00 - 15:30',
        'note': 'ประชุมทีม Marketing',
      },
    ],

    // --- วันที่ 25 กรกฎาคม 2025 ---
    DateTime.utc(2025, 7, 25): [
      {
        'title': 'ส่งโปรเจกต์ลูกค้า',
        'description': 'เดดไลน์ส่งงานโปรเจกต์ ABC',
        'time': '17:00',
      },
      {
        'title': 'เลี้ยงปิดโปรเจกต์',
        'description': 'ที่ร้านอาหาร ABCDE',
        'time': '18:30',
        'note': 'เลี้ยงปิดโปรเจกต์',
      },
    ],

    // --- วันที่ 28 กรกฎาคม 2025 ---
    DateTime.utc(2025, 7, 28): [
      {
        'title': 'วันเฉลิมพระชนมพรรษา',
        'description': 'วันหยุดนักขัตฤกษ์',
        'time': 'ทั้งวัน',
        'note': 'วันเฉลิมพระชนมพรรษา',
      },
    ],

    // --- [ข้อมูลที่เพิ่มใหม่] วันที่ 31 กรกฎาคม 2025 ---
    DateTime.utc(2025, 7, 31): [
      {
        'title': 'จ่ายเงินเดือน',
        'description': 'รอบจ่ายเงินเดือนกรกฎาคม',
        'time': 'ทั้งวัน',
        'note': 'จ่ายเงินเดือนกรกฎาคม',
      },
    ],

    // --- [ข้อมูลที่เพิ่มใหม่] วันที่ 1 สิงหาคม 2025 ---
    DateTime.utc(2025, 8, 1): [
      {
        'title': 'ประชุมประจำเดือน',
        'description': 'ประชุมสรุปผลงานเดือนกรกฎาคมและวางแผนเดือนสิงหาคม',
        'time': '10:00 - 11:30',
        'note': 'ประชุมประจำเดือน',
      },
    ],

    // --- [ข้อมูลที่เพิ่มใหม่] วันที่ 8 สิงหาคม 2025 ---
    DateTime.utc(2025, 8, 8): [
      {
        'title': 'ส่งงานโปรเจกต์ "Phoenix"',
        'description': 'เดดไลน์ส่งมอบงานเฟสที่ 1 ให้กับลูกค้า',
        'time': '17:00',
        'note': 'ส่งงานโปรเจกต์ "Phoenix"',
      },
    ],

    // --- [ข้อมูลที่เพิ่มใหม่] วันที่ 12 สิงหาคม 2025 ---
    DateTime.utc(2025, 8, 12): [
      {
        'title': 'วันเฉลิมพระชนมพรรษา (วันแม่แห่งชาติ)',
        'description': 'วันหยุดนักขัตฤกษ์',
        'time': 'ทั้งวัน',
        'note': 'วันเฉลิมพระชนมพรรษา (วันแม่แห่งชาติ)',
      },
    ],

    // --- [ข้อมูลที่เพิ่มใหม่] วันที่ 19 สิงหาคม 2025 ---
    DateTime.utc(2025, 8, 19): [
      {
        'title': 'อบรมการใช้งานระบบ HRM ใหม่',
        'description': 'อบรมสำหรับพนักงานทุกระดับ ณ ห้องประชุมใหญ่',
        'time': '13:30 - 16:30',
        'note': 'อบรมการใช้งานระบบ HRM ใหม่',
      },
    ],

    // --- [ข้อมูลที่เพิ่มใหม่] วันที่ 29 สิงหาคม 2025 ---
    DateTime.utc(2025, 8, 29): [
      {
        'title': 'Company Outing!',
        'description': 'ไปเที่ยวพักผ่อนประจำปีที่พัทยา',
        'time': 'ทั้งวัน',
        'note': 'Company Outing!',
      },
      {
        'title': 'จ่ายเงินเดือน',
        'description': 'รอบจ่ายเงินเดือนสิงหาคม',
        'time': 'ทั้งวัน',
        'note': 'จ่ายเงินเดือนสิงหาคม',
      },
    ],
  };
}
